import {T_Astronaut} from "src/modules/types.ts";

export const AstronautMocks:T_Astronaut[] = [
    {
        id: 1,
        name: "Вуди Хобург",
        status: 1,
        image: "",
        description: "В 2017 году Хобург был выбран в качестве кандидата в космонавты в 22-й группе астронавтов НАСА и в августе приступил к двухлетнему обучению. В декабре 2020 года он был объявлен одним из восемнадцати астронавтов НАСА, отобранных в рамках программы Артемида для лунной миссии в 2024 году.\\n\\nОн был выбран пилотом SpaceX Crew-6 и участником космических экспедиций МКС-68/МКС-69 в 2023 году.",
        space_time: 185,
        country: "США",
        specialization: "Пилот"
    },
    {
        id: 2,
        name: "Джош Кассада",
        status: 1,
        image: "",
        description: "17 июня 2013 года был зачислен в отряд астронавтов НАСА в составе 21-го набора НАСА в качестве кандидата в астронавты. В августе того же года приступил к прохождению курса базовой общекосмической подготовки. 9 июля 2015 года получил статус активного астронавта.\\n\\n3 августа 2018 года на пресс-конференции в Космическом центре им. Джонсона в Хьюстоне было объявлено о включении Джоша Кассада вместе с Сунитой Уильямс в экипаж первого эксплуатационного полёта корабля «Starliner» по программе CTS-1, который должен состояться в 2019 году.",
        space_time: 155,
        country: "США",
        specialization: "Астронавт"
    },
    {
        id: 3,
        name: "Николь Манн",
        status: 1,
        image: "",
        description: "В сентябре 2019 года вместе с Майклом Финком и Крисом Фергюсоном приняла участие в тренировках по отработке эвакуации экипажа спускаемого аппарата космического корабля «Starliner», проводившихся на ракетном полигоне Уайт-Сэндз[англ.] близ Аламогордо.\\n\\n9 декабря 2020 года на заседании Национального совета по космосу США было объявлено о её включении в группу астронавтов для подготовки к пилотируемым лунным экспедициям в рамках программы «Артемида».",
        space_time: 200,
        country: "США",
        specialization: "Астронавт"
    },
    {
        id: 4,
        name: "Жасмин Могбелли",
        status: 1,
        image: "",
        description: "7 июня 2017 года была зачислена в отряд астронавтов НАСА в составе 22-го набора НАСА в качестве кандидата в астронавты. 18 августа 2017 года приступила к прохождению двухлетнего курса базовой общекосмической подготовки в Космическом центре им. Джонсона в Хьюстоне. 10 января 2020 года ей была присвоена квалификация астронавт.\\n\\n9 декабря 2020 года на заседании Национального совета по космосу США было объявлено о её включении в группу астронавтов для подготовки к пилотируемым лунным экспедициям в рамках программы «Артемида».",
        space_time: 50,
        country: "США",
        specialization: "Астронавт"
    }
]